init.org
#+property: header-args :tangle "init.el" :comments link
#+startup: content indent


* init.el
** References
https://protesilaos.com/codelog/2024-11-28-basic-emacs-configuration/
** Tangle
Tangle document (src_emacs-lisp{org-babel-tangle}
#+begin_example
C-c C-v t
#+end_example
You can detangle from the source code by running src_emacs-lisp{org-babel-detangle}

Tangle only one code block 
#+begin_example
C-u C-c C-v t
#+end_example

** Put all auto generated configurations in a seperate file
This moves all the generated customize elisp to a file so it's not crowding up init.el
#+begin_src emacs-lisp  :
  (setq custom-file (locate-user-emacs-file "custom.el"))
  (load custom-file :no-error-if-file-is-missing)
#+end_src

** Set up the package manager

#+begin_src emacs-lisp :comments link
  ;; set up package sources
  (require 'package)
  (package-initialize)
  (setq package-archives
        '(("melpa" . "http://melpa.org/packages/")
          ("gnu" . "https://elpa.gnu.org/packages/")
          ("org" . "http://orgmode.org/elpa/")))
#+end_src

** Set up use-package
Emacs 29+ has use-package built in, but earlier versions need it installed
#+begin_src emacs-lisp
  (when (< emacs-major-version 29)
    (unless (package-installed-p 'use-package)
      (package-refresh-contents)
      (package-install 'use-package)))
#+end_src
I also want to globally ensure the package is installed when i invoke src_elisp{use-package}

#+begin_src 
(setq use-package-always-ensure t)
#+end_src

** Do not show confusing warning when we install packages
#+begin_src emacs-lisp
  (add-to-list 'display-buffer-alist
               '("\\`\\*\\(Warnings\\|Compile-Log\\)\\*\\'"
                 (display-buffer-no-window)
                 (allow-no-window . t)))
#+end_src

** Make C-g a bit more helpful
#+begin_src emacs-lisp
  (defun ajb/keyboard-quit-dwim ()
    "Do-What-I-Mean behavior for a general 'keyboard-quit'.
    This will quit the minibuffer even if we're not focused on it.
    DWIM Behaviour:

    - When the region is active, disable it
    - when a minibuffer is open, but not focused, close the minibuffer
    - when the completions buffer is selected, close it
    - in every other case use the regular 'keyboard-quit'"
    (interactive)
    (cond
      ((region-active-p)
       (keyboard-quit))
      ((derived-mode-p 'completion-list-mode)
       (delete-completion-window))
      ((> (minibuffer-depth) 0)
       (abord-recursive-edit)
      ((t
       keyboard-quite)))))

  (define-key global-map (kbd "C-g") #'ajb/keyboard-quit-dwim)
#+end_src
** Disable graphical bars
#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
#+end_src
** Configure theme
#+begin_src emacs-lisp
(use-package doom-themes
	     :ensure t
	     :config
	     (setq doom-themes-enable-bold t)
	     (setq doom-themes-enable-italic t)
	     (load-theme 'doom-one t)
	     (doom-themes-visual-bell-config)
	     (doom-themes-org-config))
#+end_src
** Use icon fonts
Note that you have to use src_emacs-lisp{nerd-icons-install-fonts} to install the fonts to src{~/.local/share/fonts)
#+begin_src emacs-lisp
  (use-package nerd-icons
    :ensure t)

  (use-package nerd-icons-completion
    :ensure t
    :after marginalia
    :config
    (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

  (use-package nerd-icons-corfu
    :ensure t
    :after corfu
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

  (use-package nerd-icons-dired
    :ensure t
    :hook
    (dired-mode . nerd-icons-dired-mode))
#+end_src
** Configure minibuffer and related
*** Vertico
This package will produce a verticle layout of the mb
#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :hook (after-init . vertico-mode))
  #+end_src
*** Marginalia
Shows helpful information about commands in the mb
  #+begin_src emacs-lisp
    (use-package marginalia
      :ensure t
      :hook (after-init . marginalia-mode))
#+end_src
*** Orderless
This will help search mb commands in any order. For example, if we want src{display-line-numbers-mode} we can type something like src{li num dis} in the mb and we'll get the desired result. We set the other pattern matching styles to src{nil} so we get Orderless everywhere. 
#+begin_src emacs-lisp
  (use-package orderless
    :ensure t
    :config
      (setq completion-styles '(orderless basic))
      (setq completion-category-defaults nil)
      (setq completion-category-overrides nil))
#+end_src

*** Savehist
Keeps a record of user inputs and stores them across session
 #+begin_src emacs-lisp
   (use-package savehist
     :ensure nil ; built in to emacs
     :hook (after-init . savehist-mode))
 #+end_src
*** Corfu
Completion popups for mb
[[https://github.com/minad/corfu][Corfu on github]]
#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :hook (after-init . global-corfu-mode)
    :config
      (setq tab-always-indent 'complete)
  (setq corfu-preview-current nil)
  (setq corfu-min-width 20)

  (setq corfu-popupinfo-delay '(1.25 . 0.5))
  (corfu-popupinfo-mode 1) ; shows documentation after `corfu-popupinfo-delay'

  ;; Sort by input history (no need to modify `corfu-sort-function').
  (with-eval-after-load 'savehist
    (corfu-history-mode 1)
    (add-to-list 'savehist-additional-variables 'corfu-history)))
#+end_src
** Dired Tweaks
*** Dired proper
#+begin_src emacs-lisp
  (use-package dired
    :ensure nil
    :commands (dired)
    :hook
    ((dired-mode . dired-hide-details-mode)
     (dired-mode . hl-line-mode))
    :config
    (setq dired-recursive-copies 'always)
    (setq dired-recursive-deletes 'always)
    (setq delete-by-moving-to-trash t)
    (setq dired-dwim-target t))
#+end_src
*** Dired-subtree
#+begin_src emacs-lisp
(use-package dired-subtree
  :ensure t
  :after dired
  :bind
  ( :map dired-mode-map
    ("<tab>" . dired-subtree-toggle)
    ("TAB" . dired-subtree-toggle)
    ("<backtab>" . dired-subtree-remove)
    ("S-TAB" . dired-subtree-remove))
  :config
  (setq dired-subtree-use-backgrounds nil))
#+end_src

*** Trashed
       
#+begin_src emacs-lisp
  (use-package trashed
  :ensure t
  :commands (trashed)
  :config
  (setq trashed-action-confirmer 'y-or-n-p)
  (setq trashed-use-header-line t)
  (setq trashed-sort-key '("Date deleted" . t))
  (setq trashed-date-format "%Y-%m-%d %H:%M:%S"))

#+end_src
** Undocumented
#+begin_src emacs-lisp
  (require 'org-protocol)
  (setq inhibit-startup-message t)
  (tool-bar-mode -1)
  (fset 'yes-or-no-p 'y-or-n-p)
  (global-set-key (kbd "<f5>") 'revert-buffer)

  (use-package which-key
    :ensure t
    :config
    (which-key-mode))

  (use-package flycheck
    :ensure t
    :init
    (global-flycheck-mode t))



  ;;set bsd style C coding
  (setq-default c-default-style "linux")




  (setq-default electric-pair-inhibit-predicate
                (lambda (c)
                  (if (char-equal c ?<) t (electric-pair-default-inhibit c))))


  (setq-default electric-pair-preserve-balance nil)



  (global-visual-line-mode t)







#+end_src
** Emacs Server
#+begin_src emacs-lisp
  (load "server")
  (unless (server-running-p) (server-start))
#+end_src
** Ibuffer
#+begin_src emacs-lisp
  ;; ibuffer stuff
  (global-set-key (kbd "C-x C-b") 'ibuffer)

  (setq ibuffer-saved-filter-groups
        '(("home"
           ("emacs" (mode . emacs-lisp-mode))
           ("dired" (mode . dired-mode))
           ("slime" (mode . slime-repl-mode))
           ("org" (mode . org-mode))
           ("cpp" (mode . c++-mode))
           ("lisp" (mode . lisp-mode))
           ("build" (or (mode . make-mode)
                        (mode . cmake-mode)))
           ("gdb" (or (mode . gud-mode))))))

  (add-hook 'ibuffer-mode-hook
            '(lambda ()
               (ibuffer-auto-mode 1)
               (ibuffer-switch-to-saved-filter-groups "home")))
  (setq ibuffer-expert t)
#+end_src

** Aliases
#+begin_src emacs-lisp
  (defalias 'emc 'find-file)
#+end_src

#+begin_src emacs-lisp
  (use-package eshell-info-banner
    :ensure t
    :defer t
    :hook (eshell-banner-load . eshell-info-banner-update-banner))

  (setq inferior-lisp-program "sbcl")

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((lisp . t)))

  (setq org-babel-lisp-eval-fn #'slime-eval)

  (require 'org-tempo)


  ;; tags for code navigation
  (use-package ggtags
    :ensure t
    :config
    (add-hook 'c-mode-common-hook
              (lambda ()
                (when (derived-mode-p 'c-mode 'c++-mode)
                  (ggtags-mode 1)))))


  (use-package yasnippet
    :ensure t
    :init
    (yas-global-mode 1))


  (use-package helm-bibtex
    :config
    (setq bibtex-completion-pdf-field "File"
          bibtex-completion-notes-path org-directory
          bibtex-completion-additional-search-fields '(keywords))
    :bind
    (("C-c n B" . helm-bibtex)))


  (defvar ajb/inbox-file "~/org/inbox.org" "The location of my inbox file.")
  (defvar ajb/org-dir "~/org")


  (use-package org
    :after
    denote
    :bind
    (("C-c c" . org-capture)
     ("C-c l" . org-store-link))
    :custom
    (org-default-notes-file ajb/inbox-file)
    (org-capture-bookmark nil)
    ;;capture templates
    (org-capture-templates
     '(("f" "Fleeting note" item
        (file+headline org-default-notes-file "Notes")
        "- %?")
       ("p" "Permanent note" plain
        (file denote-last-path)
        #'denote-org-capture
        :no-save t
        :immediate finish nil
        :kill-buffer
        :jump-to-captured t)
       ("t" "New task" entry
        (file+headline org-default-notes-file "Tasks")
        "* TODO %i%?"))))


  (defvar ajb/denote-dir "~/org/denote")
  (use-package denote
    :init
    (require 'denote-org)
    (denote-rename-buffer-mode 1)
    :custom
    (denote-directory ajb/denote-dir)
    :hook
    (dired-mode . denote-dired-mode)
    :custom-face
    (denote-faces-link ((t (:slant italic)))))

  (use-package consult-notes
    :commands (consult-notes
               consult-notes-search-in-all-notes)
    :custom
    (consult-notes-file-dir-sources
     `(("Denote" ?d ,ajb/denote-dir)))
    :config
    (when (locate-library "denote")
      (consult-notes-denote-mode)))

  (use-package citar
    :ensure t
    :defer t
    :custom
    (citar-bibliography '("~/org/references.bib"))
    (citar-open-always-create-notes nil)
    :init
    (fido-vertical-mode 1)
    :bind ("C-c w c" . citar-create-note))

  (use-package citar-denote
    :ensure t
    :demand t
    :after (:any citar denote)
    :custom
    (citar-open-always-create-notes t)
    :init
    (citar-denote-mode))
#+end_src
